# Making a dataframe

In [1]:
import pandas as pd

* Use 'Dictionary' syntax to create a dataframe

In [15]:
df = pd.DataFrame({'a': [1, 2, 3, 4], 'b' : [5, 6, 7, 8], 'c' : [9, 10, 11, 12]})

In [16]:
df

   a  b   c
0  1  5   9
1  2  6  10
2  3  7  11
3  4  8  12

* Use 'List' to create a dataframe

In [17]:
a = [[1, 4, 7], [2, 5, 8], [3, 6, 9]]

In [18]:
df2 = pd.DataFrame(a)

In [19]:
df2

   0  1  2
0  1  4  7
1  2  5  8
2  3  6  9

In [20]:
df2.columns = ['a', 'b', 'c']

* change field names

In [21]:
df.columns = ['d', 'e', 'f']

In [23]:
df

   d  e   f
0  1  5   9
1  2  6  10
2  3  7  11
3  4  8  12

* copy dataframes

In [24]:
import copy

In [25]:
df3 = copy.deepcopy(df)

In [26]:
df3

   d  e   f
0  1  5   9
1  2  6  10
2  3  7  11
3  4  8  12

* extracting columns

# Extracting columns

* create a series in pandas

In [27]:
a = pd.Series([1, 2, 3, 1, 2, 3])

In [28]:
a

0    1
1    2
2    3
3    1
4    2
5    3
dtype: int64

* change index

In [29]:
a = pd.Series([1, 2, 3, 1, 2, 3], index = ['a', 'b', 'c', 'd', 'e', 'f'])

In [30]:
a

a    1
b    2
c    3
d    1
e    2
f    3
dtype: int64

# Extracting data with conditions

In [31]:
df = pd.DataFrame({'a': [i for i in range(1, 6)], 'b' : [i for i in range(6, 11)], 'c' : [i for i in range(11, 16)]})

In [32]:
df

   a   b   c
0  1   6  11
1  2   7  12
2  3   8  13
3  4   9  14
4  5  10  15

In [33]:
df[['a', 'c']]

   a   c
0  1  11
1  2  12
2  3  13
3  4  14
4  5  15

In [34]:
df[df['a'] >= 3]

   a   b   c
2  3   8  13
3  4   9  14
4  5  10  15

In [35]:
df[df['a'] >= 3][['a', 'b']]

   a   b
2  3   8
3  4   9
4  5  10

In [36]:
df[(df['a'] >= 3) & (df['b'] < 16)]

   a   b   c
2  3   8  13
3  4   9  14
4  5  10  15

In [37]:
TF = (df['a'] >= 3) & (df['b'] < 16)

In [38]:
TF

0    False
1    False
2     True
3     True
4     True
dtype: bool

In [39]:
df[TF]

   a   b   c
2  3   8  13
3  4   9  14
4  5  10  15

In [40]:
df.drop(df.index[:4])

   a   b   c
4  5  10  15